package com.robot.module.app
{
   import com.robot.app2.control.activityHelper.ActivityModel;
   import com.robot.core.animate.AnimateManager;
   import com.robot.core.manager.ModuleManager;
   import com.robot.core.manager.StatManager;
   import flash.utils.ByteArray;
   import org.taomee.events.SocketEvent;
   
   public class PumpkinGhostKidS2Panel extends ActivityModel
   {
      private var _curEvent:int;
      
      private var _curIndex:int;
      
      private var _item_1:int;
      
      private var _item_2:int;
      
      private var _item_3:int;
      
      private var _item_4:int;
      
      private var _num:int;
      
      private var _name:Array;
      
      private var _title:Array;
      
      private var _optionA:Array;
      
      private var _optionB:Array;
      
      private var _endA:Array;
      
      private var _endB:Array;
      
      private var _a:Array;
      
      private var _b:Array;
      
      private var _c:Array;
      
      private var _d:Array;
      
      private var _NUM1:Array;
      
      private var _NUM3:Array;
      
      private var _e:Array;
      
      private var _f:Array;
      
      private var _g:Array;
      
      private var _h:Array;
      
      private var _NUM2:Array;
      
      private var _NUM4:Array;
      
      private var result:int;
      
      public function PumpkinGhostKidS2Panel()
      {
         this._name = ["《启程》","《推销Ⅰ》"," 《最后一块肉》","《茶馆》","《无梯高塔》","《南瓜小鬼Ⅰ》","《驱鬼》","《选择》","《人鱼》","《四足镇水兽》","《恶猫来袭》","《透明斗篷》","《光头的新衣》","《猪猪兄弟》","《来路不明的绒衣》","《乞讨》","《邪恶向日葵》","《魔术师的兔子》","《推销Ⅱ》","《推销Ⅲ》","《上好的火柴》","《借钱》","《离家出走的熊孩子》","《求饶》","《发商》","《歌者》","《史莱姆》","《史莱姆之死》","《穷途魔女》","《治愈之泉》","《委托Ⅰ》"," 《委托Ⅱ》","《临时工》","《疗伤》","《闲逛》","《南瓜小鬼Ⅱ》","《昙花的约定》"," 《七兄弟》","《危机》","《无赖》","《青蛙》","《节日》","《菌子》","《章鱼烧》","《聒噪声音》","《落魄画家》","《卖花女孩》","《甜蜜邀约》","《赐福》","《无头的骑士》","《惊喜》","《团圆》","《薯条》","《小狗》"];
         this._title = ["欢迎来到异闻之地，展开你的冒险吧","调查路上遇上带着礼帽的神秘男子，向你推销可以辟邪的鸡毛毯子，你选择购买吗？","你在村口遇到一个卖肉屠户——可疑的火柴妖精呼号到：“买点肉吧~路边的好心人买一点吧。”你的选择是：","一位身着雪白礼服的女孩倚在茶馆的窗前，向路边的旅客推销：“各位~各位~知道哪家茶馆的茶最醇香吗？——是我家的、是我家的呀。”你的选择是：","路过一座高塔，里面传来女人的呼救。这座高塔没有梯子，只有垂下的一股发须状的物体——看起来油腻腻的。你的选择是：","打听到南瓜小鬼的消息：据说它在村外的瓜田里。你来到此处，应该采取什么策略呢？","有个只有一只脚和一只眼的老婆婆穿着沾满煤灰的围裙问你愿不愿意接受委托：她的男朋友最近被鬼缠上了，希望你帮忙驱鬼。你决定？","食粮不足，你准备打猎维持库存，在池塘边找到一群黄毛小鸭子和一只脱离了鸭群、个头较大的“丑鸭子”。瞄准哪个目标下手呢？","一只渔翁在海边钓到了整整一马车的鱼，他的秘诀是利用囚禁的人鱼的歌声吸引到鱼群。听闻此事，你决定：","一个小伙在街边叫卖：“白灼四足镇水兽，虽然小贵但好吃！”，旁边宣传板上画着一个灰色毛发的古怪生物，客人络绎不绝，你走上前去，决定：","街边有一个玩杂耍的节目，被人群层层围住：其中有一个节目是让一个拇指大小的小人儿骑在仓鼠的背上冲刺。这时你看到房顶上有一只野猫在逼近。你选择：","你在一家装备店看见一件“透明斗篷”，这件斗篷不能让披上的人隐形，却能让披上的人看起来没穿衣服。你会：","你在路上看到一个醉酒还赤身裸体的光头，他引起了路人的慌乱。他喊叫着：“我穿衣服了！我穿衣服了！！你们别怕我！！”但大家纷纷尖叫躲开，引来了持剑的卫兵。","身着狼皮绒袄的小红帽准备潜入猪猪三兄弟的家，准备为躺在病床上的奶奶熬点骨头汤。你得知她的计划后,决定：","猪猪兄弟日前获得了一件狼皮绒衣，正在低价出售。只需要花些钱，就能保护身体不受冷风的侵袭。你决定："," 一个衣衫褴褛的妇人在路边乞讨，只听她神志不清地听她说什么：“女儿，我的女儿……”，你决定："," 村口流传着一个传言：地里的向日葵在晚上的时候会露出尖牙，张开大嘴吃人， 很多去过田里的人已经失踪了。村里的人向你求助，你决定："," 一只穿靴子的兔子挡在了你的面前，它自称是最伟大的魔术师的助手，现在向你兜售一瓶可以带来幸运的圣水。","调查路上遇到神秘的老头，他说如果你把一部分灵魂出卖给他就能得到丰厚的奖赏。你决定：","  一个穿靴子的兔子告诉你，如果给它一部分钱，它可以用魔法把钱翻倍，然后还给你决定：","集市上，一个小贩正在利用神奇的木偶来赚钱：威胁烧掉木偶强迫它说谎，再当场锯掉它变长的鼻子卖钱。据说木质很耐燃，做成火柴广受欢迎。你决定：","猪猪三兄弟找你借钱，因为木房子盖到一半需要升级成石房子，准备资金不太够，之后会返还你利息。你决定：","独身的老木匠向你求助：自己老来得子，但前一阵子刚刚收养的孩子闹脾气离家出走了，希望你能够帮忙找到他，他只能求你帮忙了。你决定：","从酒馆出来的你，意识不清，遇上了一伙劫匪，他们让你交出身上的钱财，否则让你吃好果子。你决定：","一个灰色袍子的人拦住了你，从怀里偷偷掏出一卷金色的秀发问你要不要买，你决定：","有一只会唱歌的驴，请求你听他唱歌，如果接受他的请求，就会给你一点感谢之礼。你愿意听他唱歌吗？","传说中史莱姆是不老不死的神奇物种，一位奄奄一息的老人为了能够实现自己长生不老的梦想决定去森林里求助女巫把自己变成史莱姆。你得知他的想法后："," 你走在路上遇到一个被顽皮孩童围攻的可怜生物，看起来是：一个包裹在凝胶状史莱姆体内一个人头，咿咿呀呀的喊叫着，外层的粘液被石块击碎后过一阵子又会自动复原。小孩们以折磨它为乐。你决定：","一位垂垂老矣，又神志不清的魔女跪在路边呢喃着什么，你决定：","路过一个神奇的泉水，能够治愈人的身心，但是被一伙奸商霸占，成为了他们向旅客敛财的工具。你决定：","身无分文的你决定去赚点外快：委托人需要你前往深邃洞穴，战胜凶恶熊熊，度过汹涌溪流，摘取奇异果果。你决定：","身无分文的你决定去赚点外快：委托人需要你早上帮助阿尔文子爵们喝水，中午陪阿尔文女士美容，晚上随同阿尔文公爵一同用餐。","茶馆正在招聘临时工，工作内容是帮忙搬搬盘子、负责处理闹事的客人，能够得到一份不错的赏钱同时可以白吃几顿，蹭点茶喝，你决定："," 在一处安全的地方搭建营地修养疗伤。可以选择冥想或包扎：","在优美的大自然中悠闲的闲逛，遇到了一个岔路口，你选择：","吃尽苦头，搜遍了整个农田，终于找到所谓的“南瓜妖怪”了，他们身材矮小，在瓜田里手拉着手向远处逃走了。你决定：","路过农田时，你被一个会说话的昙花拉住了衣角，你决定：","有一伙矮人在大街上指责你骑马撞伤了他们的兄弟——矮子老大，老二叫来了围观群众；老三俯身哭泣；老四去喊了卫兵；老五愤怒的朝你喊叫；老六、老七拉住你的两只手。","大街上受惊的马匹脱离了控制，朝一个行动不便的老人冲撞了过去。你决定:","遇上一个无赖之徒向你挑衅，是可忍，孰不可忍。你准备：","有一只会说话的癞蛤蟆让你吻它，它说自己是受到诅咒的王子。如果能够以此解救他，就会把遗产的一部分分给你，你决定：","你看到有一只驯鹿鞭策着六个老人正在拉雪橇，缓缓地在泥泞地小路上移动。你决定：","一个神奇的小店正在出售浓缩的菌子饮料，据说有神奇的功效，市场销量异常火爆，你决定：（请勿在现实中尝试）","听说当有妖怪找上门的时候需要给他们分发章鱼烧，这样他们就不会骚扰你。你提前准备了很多，但：","草丛中有一只尾巴几乎全秃的七彩公鸡，骂骂咧咧地似乎在诅咒着谁。"," 路边石头上坐着一个穿着破烂的画家，嘴里念叨着什么“四足镇水兽”、“八脚吞天魔”，你决定：","一个乖巧的小女孩询问你是否要买些鲜花，你决定：","瓜田里跳出一颗长着四肢的南瓜，手里握着一颗连着骨节的硕大眼球，它似乎不会说话，安静地指着瓜田深处，邀你决定？","一位长着硕大南瓜头，身披紫色长袍的家伙出现在你面前，向你兜售一瓶神奇的魔药，声称可以免疫一切诅咒，你决定？","你看到了一位身着甲胄，燃着鬼火，却唯独没有头颅的家伙正蹲坐在湖边灌水解渴，你决定？","一颗燃着鬼火的头从草丛中跳了出来！你决定？","路边立着一个帐篷，里面攒动着明暗的光影，似乎还有交谈声传出，你决定？","饥肠辘辘的你路过河边，看到有只海鸥惬意地站着，旁边有一些薯条和番茄酱，你决定？","汪汪...汪汪汪汪汪...汪汪汪...汪汪汪...远处有条小狗对你叫着，似乎想要带你去哪，你决定？"];
         this._optionA = ["A：无所畏惧地出发","A：拒绝购买","A买下他的肉，作为食粮","A：走进茶馆，休息享乐","A：顺着发须爬上高塔。","A：火烧瓜田","A：接受","A：“丑鸭子”——因为肉多","A：高价买下人鱼","A．买只尝尝","A：大声喊叫，提醒他们。","A：买下这件斗篷，拿去买西瓜。","A：把他交给卫兵","A：劝阻她，掏钱帮奶奶治病。","A：买下这件绒衣","A：伸出援手","A：安慰村民这是谣言","A:果断买下","A：与他做交易","A：选择相信他，给他钱","A：赶跑小贩，解救木偶","A：找找有没有【一键升级】","A：决定帮助无助的老木匠","A：皮肉苦可受，钱财不可失。","A：买来当装饰品好了","A：听下去","A：阻拦他，这是违反天理的。","A：赶走这群小孩。","A：上前倾听","A：乖乖付钱，享受一番。","A:接下任务","A：接下任务","A：前去打工","A：冥想","A：前往被高树遮挡的未知之所","A：离开农田就可以了，不去管他们。","A：夭寿啦！昙花说话啦！","A：你被迫赔钱了事。","A：勇敢的去救援","A：叫卫兵过来收拾他","A：这个套路，好像哪里见过。","A：解救老人，打倒邪恶驯鹿。","A：一口闷掉","A：太好吃了，先吃掉一些","A：安抚它","A：上前询问","A：来一束吧！","A：过去看看","A：买买买，有备无患！","A：交个朋友！","A：就决定是你了！收服它！","A：静心聆听","A：上前试着讨要点","A：跟上去看看"];
         this._optionB = ["B：心怀忐忑地出发","B：选择购买","B:与他战斗，掀翻它的铺子","B：径直走过","B：快跑，这是巫婆的陷阱","B：找来雇佣兵深入瓜田扫荡","B：放弃","B：鸭群——可以抓到多只","B：用武力逼迫他放生人鱼","B：询问秘诀","B：向虎视眈眈的野猫扔石头。","B：砸烂这家卖假货的店","B：帮助他逃离卫兵的追捕","B：私下告诉猪猪兄弟这件事。","B：默默路过","B：围观看是不是骗局。","B：在晚上去探明真相。","B:假装离开，暗中观察","B：拒绝他并走开","B：这是骗局，傻瓜才信","B：买根火柴","B：好的猪猪","B：希望他给点诚意。","B：交钱，交钱，求放过。","B：有古怪，盘问清楚！","B：拒绝","B：随他去，这个是他的决定。","B：用附魔的剑斩杀这只怪物。","B：径直走开","B：宁愿去旁边的河里洗，也不付钱。","B:无能为力","B：再见","B：打工是不可能打工的","B：包扎","B：前往一眼能望到边际的谷地","B：冲呀，追上去。","B：询问事由","B：求助路人","B:向她喊叫，让她避开","B：对他使用“正义之拳”。","B：搏一搏，富贵险中求。 ","B：向驯鹿讨要礼物","B：放弃尝试","B：暗自担心送完后还能剩多少","B：拔光它的尾巴！","B：无视","B：不了不了！","B：快跑！","B：再见！绝对是诈骗！","B：你好再见！","B：跳进草丛！","B：透过缝隙观察","B：继续前行，寻找食物","B：离开"];
         this._endA = ["夜莺也为你高歌，异闻之地的诡谲气氛都淡了许多。","男子离开后，草丛里跳出来一只公鸡，向你表示感谢。只是感谢而已。","火柴妖精称赞你的善良，并把这份肉送给了你。","茶馆里有唱戏的，有逗蝈蝈的，安逸的氛围让你身心放松。","塔顶的女人自称曾是公主，直到自己发臭的头发熏走了第32个异国王子。","正要放火的你被村民拦住，“放火烧田，牢底坐穿”村民的高呼使你冷静下来，险些铸成大错。","原来老婆婆多年前已经离世，驱鬼仪式上她流着泪向爱人告别。当然，她没有忘记你的报酬。","给丑小鸭过水时发现灰色竟然是被染上的，肉质又柴又苦，勉强能下咽。","鱼人给了你一记甩尾：“我就值这点钱？”老板麻利地给你退了钱，并额外补偿了一些金币。","这肉又干又苦，原来四足镇水兽这么难吃……好在能填肚子。","拇指小人被你的呼喊声吓到，从鼠背上摔了下来。","透视买来的西瓜糖分足，又水灵，你大快朵颐了一番。","卫兵奖励了你一些金币来抚慰你的心灵创伤，并告诉你最近经常发生这样的怪事……","小红帽，奶奶和猪猪三兄弟从此过上了幸福快乐的生活。","嗷呜！你感觉一股力量灌入自己的体内！","你请老妇人吃了一碗热汤面，老妇人临行前用圣水对你进行了祝福。","当晚仍有村民失踪，村民怀疑你就是向日葵怪，拿起武器朝你冲了过来，你落荒而逃","喝完之后没有什么好事发生，但总觉得神清气爽","老人金色的眼睛闪动着诡谲，笑着递给了你一袋金币，“欢迎常来”。","兔子一溜烟跑走了，和你金光闪闪的10枚金币一起。","你救出了木偶和火柴，目送它们渐渐走远。","猪猪攒够了一键升级所需的钻石，发现可以直接盖一个钻石房子了。","风风火火了一天没有任何线索，老木匠叹了口气说：“我还是重新做一个吧”","在一阵殴打中你注意到劫匪屁股上竖着天线式的尾巴，你趁它们不留神飞快逃跑了。","金色的头发异常美丽，可不知为何散发着一股难以言喻的臭味。","驴子欢快地唱了一会歌，并宣称这将是它出道的成名之作。","老人生命的烛火已如风中残烛，他并没有听你的苦心相劝，一人走入森林深处。","太阳出来了，史莱姆竟逐渐融化了，在消失前的最后一刻，它轻轻对你说了声谢谢。","“我不该把他变成史莱姆，不该对她的头发施加诅咒，不该让驴开口说话，不该给木头赐予智慧……”","泉水滋养温润，安神定心，就是价格贵了点，以及老板竟然是只兔子！","到达终点，你发现委托人就是名为阿尔文的奇异果果，你小心翼翼地将他装了回去领取报酬。","阿尔文子爵们只有巴掌大小，喂水花了一整天，好在阿尔文公爵把报酬一分不少地付给了你。","茶馆生意很好，一天下来你筋疲力尽，只想窝起来睡到自然醒。","吐息之间，你觉得内心平静了许多。","高树后竟然是一泊被苍翠环绕的湖泊，你的心神得到了安宁。","好像也没有什么坏事发生，传言终归是传言。","你仓皇离开，没想到昙花的枝叶划破了你的衣角，金币撒了一地。","好不容易处理完这件事，你忽然想起来你根本没有骑马！","你矫健地跳上马车，制服了失控的马匹。众人欢呼着为你鼓掌。","卫兵还没到，无赖就夹着尾巴逃走了。","万一这王子又老又丑又没有才华呢？","六位老人向你表达了谢意，然后鞭策着驯鹿缓慢地移动在泥泞的小路上……","味道酸甜可口，细腻温润，就是……头有些晕，身体也没力气了……","你一口干了八大海碗，章鱼烧被你扫荡一空。没成想刚放下碗门就被敲响了……","公鸡在你轻柔的安抚下平静了下来，并给你下了一个金蛋。","画家说自己正在给一位顾客画宣传海报，这次让他参考猪仔画一个“八脚吞天魔”，你和他相谈甚欢。","女孩没有向你收钱，打开篮子为你包装花束，只见里面堆满了昙花和向日葵。你接过花束，忽然觉得胸口有些发闷。","你来到了南瓜小鬼的家，它开心地与你分享了一大堆最喜欢的糖果——没错，就是手里握着的那种。 你闭着眼睛吃得很开心。嗯，的确很甜。","喝下魔药的你变成了南瓜小鬼，和这相比其它诅咒都变成祝福了吧……","对方意外地温和，它缓缓讲述了自己的往事：那是一个英俊骑士为破除爱人诅咒与入魔巫蛊师斗智斗勇的故事…… ","一番缠斗后，你胜利了， 它忽然呜咽了起来：“巫蛊师的诅咒让我失去了身体和那双飞快的靴子……现在连最后的拥有也要失去了吗？”","帐篷里传来的声音逐渐清晰：“可恶的巫蛊师”，“我们终于团圆了！” ，“多亏了这双跑得飞快的靴子！”","靠近后，听到海鸥在那说着一些关于“一生”、“目标”之类话...之后便消失了...留下了似懂非懂的你，以及美味的薯条...","跟着小狗进入了一个乐园，周围忽然出现了很多拿着剪刀的布偶，吓得你仓皇而逃。"];
         this._endB = ["你看到无数光点在密林深处闪动，似乎是什么生物的眼睛。","鸡毛掸子散发着智慧的光芒，看起来似乎物有所值。","搏斗中火柴妖精把自己点着了，肉铺化为了灰烬，你筋疲力尽地逃了出来。","你重新踏上旅途，心想下次一定。","呼救的声音在你耳畔渐渐淡去，却在你的内心不断回响。","钱也花了，雇佣兵也找了，什么也没发现，说起来……为啥要找南瓜小鬼来着？","离开小屋，屋里苍老的咳嗽声断断续续，仿佛生锈的胡琴。","鸭子捉到了，但聒噪的叫声让你有些头痛。","鱼人用眼泪消除了你的疲惫，你沉沉地睡去，第二天醒来发现泪珠凝结成了珍珠。","小伙子悄悄在你手上放了一罐灰油漆，朝你笑笑。","野猫居然会弹反，你被石头砸伤了，拇指小人感谢你的救命之恩，为你仔细包扎了伤口，并给你准备了一些礼物。","老板穿上真的透明斗篷消失不见了！","光头决定去找卖给他衣服的老板讨个说法，没成想店铺已经成了废墟。","三兄弟进化成了豪猪，无计可施的小红帽把视线投向了一旁的你……你仓皇逃离","绒衣很快就被买走了。你裹紧了单薄的衣服，继续向前方走去。","老妇人不一会就走开了，于是你也转身，没入茫茫人海。","当晚，你和几个村民一起去探查，没想到在午夜零点所有村民都变成了向日葵怪，一番搏斗让你筋疲力尽，好在遍地的瓜子可以卖个好价钱。","深夜，兔子把今天赚到的钱交给了一个戴礼帽的男子，你悄悄跟上去，但森林路况复杂，你跟丢了！","无论老人如何挽留，你都不为所动，径直地向前走去。","兔子还试图向你推销3年十二倍金币增益的魔法套餐，你头也不回地走开了。","火柴果然耐用，还会说话，漫漫长夜里有火光，有声音，看来不会寂寞了。","升级时猪猪发现木房子竟然是黄花梨木的，猪猪当即还清了欠款并额外给了你一袋子金币。","老木匠从翻箱底给你凑了十枚金币，嘱咐你旅途中如果遇到一定要联系他。","破财消灾，但内心的伤痛难以抚平。","盘问、威逼下，商人坦白自己囚禁了一个长发女孩，你立即将他扭送卫兵。","驴子不顾你的劝阻，大声嚎了起来，你连忙离开了，可那贯穿耳膜的魔音让你久久不能平静。","老人逐渐消失在了视野中，你五味杂陈地踏上了旅途。","神剑的光辉无比耀眼，史莱姆化为一团雾气消失不见，孩童们也为你欢呼。","苍老的魔女似乎在忏悔着什么，破风箱般的声音逐渐消失在耳畔……","奸商们竟然把废水直接排进了河里，不过都是洗澡水，又有什么区别呢？","冒险家协会很快找到了合适的人选","“这个阿尔文公爵的脑袋长得像个果子”你指着委托书上的照片，嘟囔着走开了","找了个地方睡了一觉，嗯，元气满满！可是今天吃什么呢？","一只森精灵为你仔细包扎了伤口，你的体力恢复了一些。","谷地空气清新，阳光正好，明智的选择！","一通追逐后发现，它们只是想找村民讨些糖果，你拖着疲惫的身躯告别了南瓜小鬼。","昙花说自己被诅咒只有黑夜才能变成人形，它希望你也能被变成昙花陪它聊天。","一个戴着礼帽的路人掏出一口锅，将七兄弟吸了进去，你趁机离开了，但大受震撼。","只见老人从口袋里掏出一袋粉色的丸子丢到马儿嘴里，马儿瞬间温顺了起来。","只一拳，无赖就躺在地上哎呦了起来。你丢下一点金币，无赖拢着金币连滚带爬地跑开了。”。","一阵黏腻潮湿的触感后，一个金币袋子出现在你的面前。王子竟然是金币精灵……这也算是以身相许了吧？ ","驯鹿给了你一只臭袜子，虽然气味逼人，但里面塞了不少金币。","你离开了小店。出门时，你看到一只兔子正在柜台后阴森地坏笑……","你数了数余下的章鱼烧，还是决定强忍着咕咕叫的肚子，晚点再吃。","你得到了羽毛，但被凶悍的公鸡啄伤了！","路过画家时你看到他的画板上有一个长着六只耳朵、八条腿、三个翅膀的黑色怪物，幼小的心灵受到了巨大震撼。","女孩的脸一下子阴沉了下来，你觉得情况不对，连忙逃走了。","在渐渐远去的诡异笑声中，你仓皇逃远了。","你走开了，远远地看到商人召集了一群南瓜小鬼，向他们分发魔药…… ","湖边传来了断断续续的抽泣声，……它是怎么哭的？","草丛后是悬崖，壁途坎坷，好在你平安落地","你看到了震撼一生的景象：一位身穿甲胄的无头骑士正在抱头痛哭……","走了好久好久，没找到吃的却在路上捡到了几枚金币...疲惫的你看着手里的金币心想：还不如去当时的河边整点薯条...","离开的路上，似乎听到远处传来了尖叫声..."];
         this._a = [0,0,10,10,-10,0,-10,20,-10,10,0,5,0,0,10,0,-10,0,0,0,-10,0,-10,-20,0,0,-10,0,0,10,-20,-10,-10,0,0,0,0,0,-20,0,0,-20,-10,10,0,0,0,10,0,0,10,0,5,0];
         this._b = [0,0,-10,-5,-10,-10,-10,0,0,0,-10,0,0,10,0,-10,-10,-10,-10,0,10,0,0,0,-5,-20,10,10,-10,0,0,0,0,10,0,10,0,-10,0,10,10,10,-5,-10,0,10,10,0,0,0,0,5,-10,0];
         this._c = [0,0,-10,10,0,-10,-10,0,-10,0,-10,20,-10,10,0,10,10,10,-10,0,0,0,10,0,5,0,0,-10,10,10,10,-10,-5,10,15,10,-5,-10,10,-10,-10,10,20,0,0,10,10,-10,-10,5,-10,5,10,-10];
         this._d = [0,0,0,-15,0,0,30,0,30,-10,0,-10,10,-20,-10,-10,0,0,20,-10,0,0,0,0,-5,20,0,0,0,-20,10,20,15,0,0,0,-20,-10,0,0,0,0,-10,0,10,0,0,0,10,5,0,0,0,0];
         this._NUM1 = [this._a,this._b,this._c,this._d];
         this._NUM3 = [];
         this._e = [0,0,-10,0,0,-10,0,30,-10,0,-5,-10,-20,-10,0,0,-15,-20,0,0,0,0,0,0,-10,0,0,0,0,-10,0,0,10,20,0,-15,0,-10,0,-10,0,0,0,0,-10,0,0,-5,0,0,-10,0,-10,0];
         this._f = [0,10,0,0,0,0,0,-10,10,-10,0,-10,0,-10,0,10,0,0,0,10,0,0,-10,0,10,10,0,-10,10,0,0,0,-5,0,15,-10,-15,0,10,0,-10,-10,0,10,-10,-10,-10,10,10,5,0,-20,0,10];
         this._g = [0,0,0,0,-10,0,0,0,0,20,0,10,0,-10,0,0,0,0,0,0,10,0,0,-10,10,-10,-10,10,0,10,0,0,10,0,0,0,-10,-20,-20,10,-10,0,-10,-10,0,-10,-10,-5,-5,-5,-10,-20,0,0];
         this._h = [0,-10,0,0,0,-10,0,0,10,-20,10,0,0,0,0,0,10,0,0,0,-10,10,10,-10,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,-10,30,20,0,0,10,0,0,0,0,0,0,0,10,0];
         this._NUM2 = [this._e,this._f,this._f,this._h];
         this._NUM4 = [];
         super();
         resUrl = "2020/1030/PumpkinGhostKidS2Panel";
         configUrl = "2020/1030/PumpkinGhostKid";
      }
      
      override public function show() : void
      {
         StatManager.sendStat2014("1016主线任务","打开主线主面板","2020运营活动");
         super.show();
      }
      
      override protected function updatePanel() : void
      {
         this._num = getValue("okEvent");
         this._curEvent = getValue("curEvent");
         _ui["mcPage"].gotoAndStop(1);
         this._setUI();
      }
      
      override protected function onPanelClick(e:*) : void
      {
         var btn_name:String = e.target.name;
         var index:int = int(e.target.name.split("_")[1]);
         switch(btn_name)
         {
            case "close":
               hide();
               ModuleManager.showAppModule("PumpkinGhostKidMainPanel");
               break;
            case "btn_" + index:
               this._curIndex = index;
               this._NUM3 = [];
               this._NUM4 = [];
               this.playAnimation1(index);
               break;
            case "goto":
               refresh();
         }
      }
      
      private function playAnimation1(index:int) : void
      {
         closeEvent();
         for(var i:int = 1; i <= 5; i++)
         {
            _ui["mc_" + i].visible = true;
         }
         _ui["mc_" + 10].visible = true;
         AnimateManager.playMcAnimate(_ui,1,"mc_" + 1);
         AnimateManager.playMcAnimate(_ui,1,"mc_" + 2);
         AnimateManager.playMcAnimate(_ui,1,"mc_" + 3);
         AnimateManager.playMcAnimate(_ui,1,"mc_" + 4);
         AnimateManager.playMcAnimate(_ui,1,"mc_" + 10);
         if(index == 1)
         {
            AnimateManager.playMcAnimate(_ui,1,"mc_" + 5,this.stopPlaying1);
         }
         else
         {
            AnimateManager.playMcAnimate(_ui,1,"mc_" + 5,this.stopPlaying2);
         }
      }
      
      private function stopPlaying1() : void
      {
         var i:int;
         for(i = 1; i <= 5; i++)
         {
            _ui["mc_" + i].visible = false;
         }
         _ui["mc_" + 10].visible = false;
         openEvent();
         doAction("FlgeReq2",1).then(function(e:SocketEvent):void
         {
            _activityHelper.update().then(function():void
            {
               var i:int = 0;
               result = ByteArray(e.data).readInt();
               if(result != 0)
               {
                  hide();
                  ModuleManager.showAppModule("PumpkinGhostKidS3Panel",result);
               }
               else
               {
                  _num = getValue("okEvent");
                  _ui["mcPage"].gotoAndStop(2);
                  if(_curIndex == 1)
                  {
                     _ui["mcPage"]["mc1"].gotoAndStop(_setMc(_a[_curEvent]));
                     _ui["mcPage"]["mc2"].gotoAndStop(_setMc(_b[_curEvent]));
                     _ui["mcPage"]["mc3"].gotoAndStop(_setMc(_c[_curEvent]));
                     _ui["mcPage"]["mc4"].gotoAndStop(_setMc(_d[_curEvent]));
                     _ui["mcPage"]["txt_6"].text = _endA[_curEvent];
                  }
                  else
                  {
                     _ui["mcPage"]["mc1"].gotoAndStop(_setMc(_e[_curEvent]));
                     _ui["mcPage"]["mc2"].gotoAndStop(_setMc(_f[_curEvent]));
                     _ui["mcPage"]["mc3"].gotoAndStop(_setMc(_g[_curEvent]));
                     _ui["mcPage"]["mc4"].gotoAndStop(_setMc(_h[_curEvent]));
                     _ui["mcPage"]["txt_6"].text = _endB[_curEvent];
                  }
                  _ui["num"].text = _num;
                  for(i = 1; i <= 4; i++)
                  {
                     _ui["mc_" + i].visible = false;
                     _ui["mcc"]["num" + i].text = getValue("item_" + i);
                     _ui["mcc"]["mccAni_" + i].gotoAndStop(getValue("item_" + i));
                  }
               }
            });
         });
      }
      
      private function _setMc(index:int) : int
      {
         if(index == 5)
         {
            return 2;
         }
         if(index == 10)
         {
            return 3;
         }
         if(index == 15)
         {
            return 4;
         }
         if(index == 20)
         {
            return 5;
         }
         if(index == 30)
         {
            return 6;
         }
         if(index == -5)
         {
            return 7;
         }
         if(index == -10)
         {
            return 8;
         }
         if(index == -15)
         {
            return 9;
         }
         if(index == -20)
         {
            return 10;
         }
         return 1;
      }
      
      private function stopPlaying2() : void
      {
         var i:int;
         for(i = 1; i <= 5; i++)
         {
            _ui["mc_" + i].visible = false;
         }
         _ui["mc_" + 10].visible = false;
         openEvent();
         doAction("FlgeReq2",2).then(function(e:SocketEvent):void
         {
            result = ByteArray(e.data).readInt();
            _activityHelper.update().then(function():void
            {
               var i:int = 0;
               if(result != 0)
               {
                  hide();
                  ModuleManager.showAppModule("PumpkinGhostKidS3Panel",result);
               }
               else
               {
                  _num = getValue("okEvent");
                  _ui["mcPage"].gotoAndStop(2);
                  if(_curIndex == 1)
                  {
                     _ui["mcPage"]["mc1"].gotoAndStop(_setMc(_a[_curEvent]));
                     _ui["mcPage"]["mc2"].gotoAndStop(_setMc(_b[_curEvent]));
                     _ui["mcPage"]["mc3"].gotoAndStop(_setMc(_c[_curEvent]));
                     _ui["mcPage"]["mc4"].gotoAndStop(_setMc(_d[_curEvent]));
                     _ui["mcPage"]["txt_6"].text = _endA[_curEvent];
                  }
                  else
                  {
                     _ui["mcPage"]["mc1"].gotoAndStop(_setMc(_e[_curEvent]));
                     _ui["mcPage"]["mc2"].gotoAndStop(_setMc(_f[_curEvent]));
                     _ui["mcPage"]["mc3"].gotoAndStop(_setMc(_g[_curEvent]));
                     _ui["mcPage"]["mc4"].gotoAndStop(_setMc(_h[_curEvent]));
                     _ui["mcPage"]["txt_6"].text = _endB[_curEvent];
                  }
                  _ui["num"].text = _num;
                  for(i = 1; i <= 4; i++)
                  {
                     _ui["mc_" + i].visible = false;
                     _ui["mcc"]["num" + i].text = getValue("item_" + i);
                     _ui["mcc"]["mccAni_" + i].gotoAndStop(getValue("item_" + i));
                  }
               }
            });
         });
      }
      
      private function _setUI() : void
      {
         var k:int = 0;
         var j:int = 0;
         var l:int = 0;
         var m:int = 0;
         _ui["num"].text = this._num;
         _ui["txt_1"].text = this._name[this._curEvent];
         _ui["txt_2"].text = this._title[this._curEvent];
         _ui["mcPage"]["txt_3"].text = this._optionA[this._curEvent];
         _ui["mcPage"]["txt_4"].text = this._optionB[this._curEvent];
         _ui["mc_" + 5].visible = false;
         _ui["mc_" + 10].visible = false;
         for(var i:int = 1; i <= 4; i++)
         {
            _ui["mc_" + i].visible = false;
            _ui["mcc"]["num" + i].text = getValue("item_" + i);
            _ui["mcc"]["mccAni_" + i].gotoAndStop(getValue("item_" + i));
            _ui["mcPage"]["ani_" + i].gotoAndStop(i);
            _ui["mcPage"]["ANI_" + i].gotoAndStop(i);
         }
         if(this._a[this._curEvent] != 0)
         {
            this._NUM3.push(1);
         }
         if(this._b[this._curEvent] != 0)
         {
            this._NUM3.push(2);
         }
         if(this._c[this._curEvent] != 0)
         {
            this._NUM3.push(3);
         }
         if(this._d[this._curEvent] != 0)
         {
            this._NUM3.push(4);
         }
         if(this._e[this._curEvent] != 0)
         {
            this._NUM4.push(1);
         }
         if(this._f[this._curEvent] != 0)
         {
            this._NUM4.push(2);
         }
         if(this._g[this._curEvent] != 0)
         {
            this._NUM4.push(3);
         }
         if(this._h[this._curEvent] != 0)
         {
            this._NUM4.push(4);
         }
         if(this._NUM3.length == 0)
         {
            for(k = 1; k <= 4; k++)
            {
               _ui["mcPage"]["ani_" + k].visible = false;
            }
         }
         else
         {
            for(j = 1; j <= 4; j++)
            {
               if(j <= this._NUM3.length)
               {
                  _ui["mcPage"]["ani_" + j].visible = true;
                  _ui["mcPage"]["ani_" + j].gotoAndStop(this._NUM3[j - 1]);
               }
               else
               {
                  _ui["mcPage"]["ani_" + j].visible = false;
               }
            }
         }
         if(this._NUM4.length == 0)
         {
            for(l = 1; l <= 4; l++)
            {
               _ui["mcPage"]["ANI_" + l].visible = false;
            }
         }
         else
         {
            for(m = 1; m <= 4; m++)
            {
               if(m <= this._NUM4.length)
               {
                  _ui["mcPage"]["ANI_" + m].visible = true;
                  _ui["mcPage"]["ANI_" + m].gotoAndStop(this._NUM4[m - 1]);
               }
               else
               {
                  _ui["mcPage"]["ANI_" + m].visible = false;
               }
            }
         }
      }
   }
}

