package com.robot.app.mapProcess.control
{
   public class NinjaTalks
   {
      
      public static var dA:Array;
      
      public static var qA:Array;
       
      
      public function NinjaTalks()
      {
         super();
      }
      
      public static function init() : void
      {
         dA = new Array();
         qA = new Array();
         dA.push(["你们给我记住！！真正的忍者精灵是要通过这些超艰难的修行而成！"]);
         qA.push(["？忍者？"]);
         dA.push(["你们! 会获得超越常人的毅力、耐力、战斗力。通过忍术的训练而幸存的忍者，个个都是一部绝对可靠的全功率战斗机器。"]);
         qA.push(["？全功率战斗机器？"]);
         dA.push(["咳咳...那个新来的，你也想拜我为师吗？"]);
         qA.push(["？我？"]);
         dA.push(["是啊，是你！你不是刚才就在心里想着忍者，想着战斗机器来着么！"]);
         qA.push(["你能读出我心里的东西？你在哪？"]);
         dA.push(["你面前台子上的装备看到没？帅不？那个就是我！"]);
         qA.push(["敢不敢把脸露一下。"]);
         dA.push(["哼，玩笑开够了！我，作为忍者祖师！你，应当下跪才是！"]);
         qA.push(["（认真）你..为什么要藏在盔甲里？"]);
         dA.push(["在远古的一次武道会上，一个名叫【阿尔卡达】的忍者对我使诈后，我就被存封在这个名为【忍魂】铠甲中500年了。"]);
         qA.push(["哇，那么久。"]);
         dA.push(["我，正等待着一个能真正配得上它的人，继承我的遗志。"]);
         qA.push(["我来试试！！"]);
         dA.push(["可惜了，没有【忍道之心】，所以无法经受得住这铠甲的重量。"]);
         qA.push(["呼呼～越有挑战，我越想得到！"]);
         dA.push(["首先，得考验你一下。"]);
         qA.push(["来吧！"]);
         dA.push(["在这个房间内找到【九字真言】中的【临】字真言。 提示：不动，不惑，不动容。"]);
         qA.push(["让我找找..."]);
         dA.push(["【临】字真言含义：临事不动，保持不动不惑的意志，表现坚强的体魄！"]);
         qA.push(["我记住了！"]);
         dA.push(["好，那就在这里随意挑选一个洛迦开始他们的训练吧！"]);
         qA.push(["null"]);
         dA.push(["就像你看到的，这种事故我曾经屡见不鲜了。"]);
         qA.push(["真可怜那！"]);
         dA.push(["希望你能帮助他，我所得知，迦贺困在暗黑的世界里。但是，你们的科技可以到达那里，只要有超能NONO。"]);
         qA.push(["我这就传送过去","我以后再过去吧"]);
         dA.push(["貌似要把他身上的黑暗物质打散了，他才能够解除禁锢。"]);
         qA.push(["看我的！"]);
         dA.push(["谢谢你们，但是我的能力已经减弱很多，赶紧的，我们得赶紧离开这里。"]);
         qA.push(["null"]);
         dA.push(["看来，你的潜在素质还是很不错的。那好，迦贺也就分配给你了。好好训练他们吧。"]);
         qA.push(["null"]);
         dA.push(["另外，听说【阿尔卡达】在不久之后又要举办武道会，到时候我希望你们能够将他击败。"]);
         qA.push(["一定！我会替天行道的！"]);
         dA.push(["还有，洛迦和迦贺达到60级后，结合你的超NO力量，我可以传授他们专属的忍者特技。"]);
         qA.push(["null"]);
         dA.push(["并且，只有当你集齐所有九字真言，激活我身后的忍魂沙盘，激活方式可以看下前方的【真言位谱】。我相信，你那时肯定能配得上这套【忍魂套装】！"]);
         qA.push(["好的，知道了"]);
         dA.push(["有什么事吗？"]);
         qA.push(["(见控制类onClickKjHandler3)"]);
         dA.push(["请让要学习技能的精灵跟随。"]);
         qA.push(["知道了"]);
         dA.push(["见控制类line 822"]);
         qA.push(["是","现在不需要"]);
         dA.push(["没有超能力量，我无法传授他们特技。"]);
         qA.push(["知道了"]);
         dA.push(["你的精灵还没达到升级条件。"]);
         qA.push(["知道了"]);
         dA.push(["好！来我的盔甲下。我将给予他最适合的特技！"]);
         qA.push(["null"]);
         dA.push(["精灵进化必须达到35级。"]);
         qA.push(["知道了"]);
         dA.push(["只有获得所有的真言水晶，正确放置在我身后的【忍魂沙盘】中，你！就将是他新的主人！"]);
         qA.push(["怎么获得【真言水晶】？","知道了"]);
         dA.push(["你确定现在就去救迦勒吗？"]);
         qA.push(["是，我现在就去","不，我现在去不了"]);
         dA.push(["我说过，我相信你，因为我早就看穿了你的真心。穿上吧，武道会将等着你的挑战。希望这套装备能带给你好运！"]);
         qA.push(["null"]);
         dA.push(["我已将技能传授予你了"]);
         qA.push(["不好意思，打扰了"]);
      }
   }
}
